blogs/how-numastat-make-cpu-high.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-09 六 22:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>numastat 如何导致目标进程CPU飙升</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">numastat 如何导致目标进程CPU飙升</h1>
<p>
问题现象：在宿主机运行numastat采集进程numa信息，K8s实例出现CPU飙升，但很快恢复，影响业务可用性。这里numastat运行在cgroup中，配额为0.2 cpu。
</p>

<div id="outline-container-org7a64341" class="outline-2">
<h2 id="org7a64341"><span class="section-number-2">1</span> 背景知识</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>numastat -p pid</code> 统计目标进程pid的内存在各个numa的分布情况，这个过程要读取 <code>/proc/pid/numa_maps</code> <code>numa_maps</code> 是虚拟文件，内核通过遍历目标进程的vma，统计内存相关的信息，这个过程比较消耗CPU。
</p>

<p>
cgroup的配额为0.2CPU，意味着CPU使用率最多20%，也就是说100ms的时间内最多运行20ms，超过20ms，进程就要被挂起，等下一个100ms周期。
</p>
</div>
</div>

<div id="outline-container-org62952b7" class="outline-2">
<h2 id="org62952b7"><span class="section-number-2">2</span> 理论分析</h2>
<div class="outline-text-2" id="text-2">
<p>
初步判断影响路径是这样的：
</p>
<ol class="org-ol">
<li>numastat 运行超过0.2CPU的限制，被挂起，被挂起时，持有目标进程的 <code>mm-&gt;mmap_sem</code> 锁;</li>
<li>而目标进程page fault时，也需要这个锁，导致进程被卡住;</li>
<li>如果numastat被挂起的时间很长，进程被卡住的线程会积累很多;</li>
<li>随着numastat运行结束、释放 <code>mm-&gt;mmap_sem</code> 锁，大量被卡住的线程开始运行，导致CPU飙升。</li>
</ol>

<p>
也就是说，目标进程的CPU有个先下降（陆续等锁）、后上升（快速获得锁）的过程，上升表现的较为明显。
</p>
</div>
</div>

<div id="outline-container-orga8b5734" class="outline-2">
<h2 id="orga8b5734"><span class="section-number-2">3</span> 验证分析</h2>
<div class="outline-text-2" id="text-3">
<p>
通过复制线上流量测试，复现了该问题。实例CPU从144%，在2秒内下降到3%，然后在下1秒上升到289%。符合理论分析。
使用 <code>offcputime</code> 分析CPU下降的原因（下降必然是让出了CPU）。发现是 <code>rwsem_down_read_failed</code> 让出CPU，和加锁失败有关。
</p>

<pre class="example">
$ offcputime -K -p 3629 10
  finish_task_switch
  __sched_text_start
  schedule
  rwsem_down_read_failed
  __do_page_fault
  do_page_fault
  page_fault
</pre>

<p>
对比<code>rwsem_down_read_failed</code> 的延迟和次数，在numastat CPU节流时上升明显。
</p>
<pre class="example">
$ funclatency -mT -d 10 -p 3629 rwsem_down_read_failed

# 正常情况
  0 -&gt; 1      : 105
  2 -&gt; 3      : 34
128 -&gt; 255    : 12
256 -&gt; 511    : 6
512 -&gt; 1023   : 12

# numastat CPU节流时
   0 -&gt; 1     : 6466
   2 -&gt; 3     : 625
   4 -&gt; 7     : 359
   8 -&gt; 15    : 71
  16 -&gt; 31    : 55
  32 -&gt; 63    : 503
  64 -&gt; 127   : 277
1024 -&gt; 2047  : 43
2048 -&gt; 4095  : 190
</pre>
</div>
</div>

<div id="outline-container-org9691611" class="outline-2">
<h2 id="org9691611"><span class="section-number-2">4</span> CPU节流</h2>
<div class="outline-text-2" id="text-4">
<p>
cgroup实现cpu配额的机制是这样的：cgroup中的程序在 <code>cfs.cpu_period_us</code> 周期内，不能使用超过 <code>cfs.cpu_quota__us</code> 的CPU，如果超过，进程会被挂起。那问题来了，谁来执行这个检查呢？可用分两部分来看：
</p>
<ol class="org-ol">
<li>程序运行在用户态是，内核通过定时中断来检查CPU是否超配;</li>
<li>如果进入内核态，内核不会自己中断自己，必须运行到某些检查点函数，才检查CPU是否超配。</li>
</ol>

<p>
从2可知，在内核态可能出现CPU配额限制不住的情况，只要没有到检查点，可以不受CPU配额的影响。
</p>
</div>
</div>

<div id="outline-container-org371bc4c" class="outline-2">
<h2 id="org371bc4c"><span class="section-number-2">5</span> numastat 如何被节流</h2>
<div class="outline-text-2" id="text-5">
<p>
numastat 节流可能发生在用户态、内核态。
</p>

<p>
首先可以排除用户态，进程在用户态不会持有内核锁 <code>mm-&gt;mmap_sem</code> 。从设计上来讲，比较显而易见。查看内核代码，也可以印证这点：
</p>
<ol class="org-ol">
<li><code>numa_maps</code> 文件的 open 函数 <code>pid_maps_open</code> ，不会持有 <code>mm-&gt;mmap_sem</code> ，只是准备相关数据结构;</li>
<li><code>numa_maps</code> 文件的 read 函数 <code>seq_read</code> 通过 <code>m_start</code> 持有锁，通过 <code>show_numa_map</code> 读取 vma 相关信息，通过 <code>m_stop</code> 释放锁。在一次read中，完成加锁、读、解锁的过程。</li>
</ol>

<p>
那只能是内核态了，可以对比 <code>show_numa_map</code> 的延迟，的确有长尾，应该和CPU节流有关。
</p>

<pre class="example">
# 因为编译优化 show_numa_map 真正的函数加上了 isra.34 后缀
$ funclatency -mT -d 10 -p 3629 show_numa_map.isra.34

# 正常情况
  0 -&gt; 1     : 53960
  8 -&gt; 15    : 90

# numastat CPU节流时
  0 -&gt; 1     : 55615
  8 -&gt; 15    : 46
 64 -&gt; 127   : 101
</pre>

<p>
可用查看numastat CPU节流时的栈。
</p>
<pre class="example">
$ stackcount throttle_cfs_rq

  throttle_cfs_rq
  check_cfs_rq_runtime
  pick_next_task_fair
  __sched_text_start
  preempt_schedule_common
  _cond_resched
  gather_pte_stats
  walk_pgd_range
  show_numa_map.isra.34
  seq_read
  vfs_read
  ksys_read
</pre>

<p>
这下问题就清楚了，在持有 <code>mm-&gt;mmap_sem</code> 锁的情况下， <code>gather_pte_stats</code> 调用 <code>_cond_resched</code> 进入CPU配额检查点。就算没有CPU节流，在持有锁的情况下调用 <code>_cond_resched</code> 本身也是一种风险。
</p>
</div>
</div>

<div id="outline-container-org28ef94e" class="outline-2">
<h2 id="org28ef94e"><span class="section-number-2">6</span> 总结</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>numastat 被CPU节流时，会影响目标进程的 pagefault;</li>
<li>进程CPU飙升前可能经历了CPU下降。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-09-09 六 22:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
